farmertan81/Spot-Welder/STM32G474CE/src/main.c
#include <math.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "stm32_settings_flash.h"
#include "stm32g4xx_hal.h"

/* ===== Forward decls ===== */
static void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM1_Init(void);
static void init_tim2_1mhz(void);
static void MX_ADC1_Init(void);
static void MX_ADC2_Init(void);
static void MX_I2C1_Init(void);
static void MX_IWDG_Init(void);
static void i2c_bus_recovery(void);

static void uartSend(const char* s);
static void jumpToBootloader(void);
static void requestBootloaderReset(void);
static inline void pwmOff(void);
static inline void pwmOnDuty(uint16_t duty);
static void clampParams(void);
static void applyArmTimeout(void);
static void applyReadyTimeout(void);
static uint16_t pctToDuty(uint8_t pct);
static uint32_t doPulseMsPwm(uint16_t ms, uint16_t duty, uint32_t* pwm_on_us,
                             uint32_t* pwm_off_us,
                             uint16_t* pwm_off_waveform_index);
static void captureGapMsWithWaveform(uint16_t ms);
static void fireRecipe(void);
static void parseCommand(char* line);
static void pollPedal(void);
static void pollContactTrigger(void);
static uint32_t adcReadChannel(uint32_t channel);
static uint32_t adcReadChannel2(uint32_t channel);
static float measureVDDA(void);
static float readThermistor(void);
static float readCapVoltage(void);
static bool contactDetectedRaw(float* out_vcap);
static bool contactDetected(void);
static void persistent_defaults(PersistentSettings* out);
static void persistent_from_runtime(PersistentSettings* out);
static void apply_loaded_settings(const PersistentSettings* in);

/* NEW: Shunt sensing / ADC helpers */
static uint32_t adcReadSingleConfigured(ADC_HandleTypeDef* hadc,
                                        uint32_t timeout_ms);
static uint32_t adcReadChannelWithTiming(ADC_HandleTypeDef* hadc,
                                         uint32_t channel,
                                         uint32_t sampling_time,
                                         uint32_t timeout_ms);
static void adcPrepareFastCurrentChannels(void);
static void adcPrepareVcapNChannel(void);
static uint32_t adcChannelEnumToNumber(uint32_t channel_enum);
static bool adcReadFastCurrentPair(uint32_t* out_p, uint32_t* out_n);
static bool adcReadFastTriplet(uint32_t* out_p, uint32_t* out_n,
                               uint32_t* out_vp);
static uint32_t adcReadFastVcapN(void);
static void capturePulseAmpsForDurationUs(uint32_t pulse_duration_us,
                                          uint16_t duty);

/* NEW: INA226 Forward Decl */
static bool ina226_write_reg(uint8_t addr, uint8_t reg, uint16_t val);
static bool ina226_read_reg(uint8_t addr, uint8_t reg, uint16_t* val);
static bool ina226_read_bus_voltage(uint8_t addr, float* voltage);
static bool ina226_read_shunt_current(uint8_t addr, float* current);
static bool ina226_health_check(void);
static void ina226_read_all(void);
static void chargerStateMachine(void);
static void sendStatusPacket(void);

/* Waveform capture helpers (Phase 3) */
static inline uint32_t micros_now(void);
static void tim2_delay_us(uint32_t delay_us);

/*
 * TIM2 ISR FET-kill flag.
 * When TIM2 expires during a pulse, the ISR calls pwmOff() in hardware
 * interrupt context (~70ns latency) and sets this flag so the sampling
 * loop knows to stop.  Volatile because it is written in ISR, read in
 * main-thread polling loop.
 */
static volatile bool tim2_fet_killed = false;
static void start_weld_pulse_capture(void);
static void capture_waveform_samples(uint16_t sample_count);
static uint16_t capture_waveform_until_deadline(uint32_t deadline_us);
static void end_weld_pulse_capture(void);
static void apply_waveform_voltage_interpolation(float vcap_start,
                                                 float vcap_end,
                                                 uint16_t pulse_start_index,
                                                 uint16_t pulse_end_index);
static void send_waveform_data(void);
static uint16_t get_planned_active_pulse_ms(void);
static bool waveform_push_sample(float current_amps, float voltage_volts,
                                 uint32_t timestamp_us);
static bool resolve_phase_start_from_waveform(uint16_t start_index,
                                              uint16_t end_index,
                                              uint32_t* out_abs_us);
static bool resolve_phase_end_from_waveform(uint16_t start_index,
                                            uint16_t end_index,
                                            uint32_t* out_abs_us);

/* ============ Pins (fixed) ============ */
#define WELD_TIM TIM1
#define WELD_TIM_CH TIM_CHANNEL_1
#define PEDAL_PORT GPIOB
#define PEDAL_PIN GPIO_PIN_12
#define LED_PORT GPIOC
#define LED_PIN GPIO_PIN_6

/* Contact detection uses AMC1311B capacitor voltage sensing on PA3/PA4. */

/* NEW: Charger enable pin */
#define CHARGER_EN_PORT GPIOB
#define CHARGER_EN_PIN GPIO_PIN_2

/* ============ Billet Shunt Calibration (0.3885" @ 15mm) ============ */
/* Physical chain: Amps → µV across shunt → ×41 (AMC1302) → ADC counts */
#define SHUNT_GAIN 8.2f          /* AMC1301 fixed gain                  */
#define SHUNT_EFF_OHMS 0.000050f /* 50 µΩ effective shunt (calibrated) */

/* ============ Current Calibration Factor ============ */
/* Calibrated against 400F capacitance discharge test (2025-04-21):
 *   Discharge test: 8.74V -> 7.70V @30s -> 6.81V @60s, R=0.6Ω
 *   Result: C = 400F (confirmed via exponential decay)
 *   Weld test: ΔV=0.103V over 10ms on 400F caps => I_real = 4,120A
 *   Reported I = 2,339A => error = 1.76x too low
 * Applied as multiplier on computed amps. Adjust if shunt/chain changes.
 */
#define CURRENT_CAL_FACTOR 1.76f

/* ============ Capacitor Bank ============ */
/* Measured via resistive drawdown: 8.98V → 4.49V, R=6Ω, t=172.08s
 * C = (t × 1.4427) / R = 413F
 * Config: 6× 1000F/3V caps, 3S2P */
#define CAP_FARADS 413.0f
#define JOULE_OVERSHOOT_COMP \
    0.2f /* Joules - compensate for FET turn-off delay */

/* ============ Thermistor / ADC ============ */
#define THERM_SERIES_R 10000.0f
#define THERM_NOMINAL_R 10000.0f
#define THERM_NOMINAL_T 25.0f
#define THERM_BETA 3950.0f
#define THERM_OFFSET_C 0.0f

