farmertan81/Spot-Welder/STM32G474CE/src/main.c
static GPIO_PinState pedal_last_raw = GPIO_PIN_SET;
static GPIO_PinState pedal_stable = GPIO_PIN_SET;
static uint32_t pedal_last_change_ms = 0;

static float temp_filtered_c = 25.0f;
static float current_peak_amps = 0.0f;  // Track peak of recipe

/* Added calibration capture values */
static float cal_vcap_before = 0.0f;
static float cal_vcap_after = 0.0f;
static uint32_t cal_adc_peak_raw = 0;
static float cal_current_avg = 0.0f;

/* Configurable lead resistance (default 1.1 mΩ).
 * Measured: 0.54 mΩ + 0.57 mΩ = 1.1 mΩ total (4-wire Kelvin test).
 * 41% improvement over previous leads (1.87 mΩ → 1.1 mΩ). */
static float lead_resistance_ohms = 0.0011f;  // 1.1 mΩ measured
static PersistentSettings g_persistent_settings = {0};
static const float LEAD_RESISTANCE_MIN_OHMS = 0.0001f; /* 0.1 mΩ */
static const float LEAD_RESISTANCE_MAX_OHMS = 0.0100f; /* 10.0 mΩ */

/* ============ Waveform Capture (Phase 3) ============ */
#define WAVEFORM_BUFFER_SIZE 4096
#define WAVEFORM_CHUNK_SAMPLES 100U
#define WAVEFORM_LINE_BUFFER_SIZE (WAVEFORM_CHUNK_SAMPLES * 18 + 256)
#define WAVEFORM_SAMPLE_INTERVAL_US 100U
/*
 * Gap timing compensation: scope-measured overhead from preheat-FET-off
 * to gap-timer-start plus gap-timer-end to main-FET-on.  This fixed cost
 * comes from waveform bookkeeping, timestamp capture, and function call
 * overhead.  Empirically measured at ~90µs via oscilloscope.
 *
 * Adjust this value if you change compiler optimization level or modify
 * the fireRecipe() gap bookkeeping code.
 */
#define GAP_TIMING_COMPENSATION_US 150U
#define PWM_PERIOD_US 100U
#define WAVEFORM_PWM_PHASE_SWEEP_STEP_US 12U
#define WAVEFORM_PWM_PHASE_SWEEP_SAMPLES 6U
#define WAVEFORM_PRE_SAMPLES 10U  /* 1ms pre-buffer */
#define WAVEFORM_POST_SAMPLES 10U /* 1ms post-buffer */
#define WAVEFORM_MAX_PULSE_MS 100U
#define WAVEFORM_MAX_ACTIVE_SAMPLES \
    ((WAVEFORM_MAX_PULSE_MS * 1000U) / WAVEFORM_SAMPLE_INTERVAL_US)

/* Temporary ADC debug switch:
 * 1 = re-apply ADC channel config inside adcReadFastCurrentPair() for A/B
 * check. 0 = rely only on pre-config from adcPrepareFastCurrentChannels(). */
#define ADC_DEBUG_USE_OLD_CONFIG 0
#define ADC_PAIR_VERBOSE_DEBUG 0  // Set to 1 only for debugging ADC reads

#define ADC_FAST_CURRENT_P_CHANNEL ADC_CHANNEL_2
#define ADC_FAST_CURRENT_N_CHANNEL ADC_CHANNEL_3

/* Capture capacity supports up to 1ms pre + 100ms pulse + 1ms post = 1020
 * samples. Keep a larger ring (4096) for debug headroom and future longer
 * windows. */
_Static_assert(WAVEFORM_BUFFER_SIZE >=
                   (WAVEFORM_PRE_SAMPLES + WAVEFORM_MAX_ACTIVE_SAMPLES +
                    WAVEFORM_POST_SAMPLES),
               "WAVEFORM_BUFFER_SIZE too small for 100ms capture window");

/* Safety check: each sample adds ~14 chars (",AAAA.AA,VV.VV") to WAVEFORM line.
 */
_Static_assert(
    WAVEFORM_BUFFER_SIZE <= 4096,
    "Unexpected waveform buffer growth; re-check RAM/UART line budget");
_Static_assert(WAVEFORM_LINE_BUFFER_SIZE >= (WAVEFORM_CHUNK_SAMPLES * 18 + 256),
               "WAVEFORM_LINE_BUFFER_SIZE too small for waveform CSV payload");

typedef struct {
    float current_amps;
    float voltage_volts;
    uint32_t timestamp_us;
} WaveformSample;

static WaveformSample waveform_buffer[WAVEFORM_BUFFER_SIZE];
static volatile uint16_t waveform_index = 0;
static volatile bool waveform_capture_active = false;
static uint32_t waveform_capture_start_us = 0;
static uint32_t waveform_last_sample_us = 0;
static uint16_t waveform_pulse_start_index = 0;
static uint16_t waveform_pulse_end_index = 0;

/* Phase markers for host/UI visualization.
 * All indices are sample indices with end indices EXCLUSIVE.
 * WAVEFORM_START emits: total, pre_start, pre_end, gap_start, gap_end,
 * main_start, main_end. */
static uint16_t waveform_preheat_start_index = 0;
static uint16_t waveform_preheat_end_index = 0;
static uint16_t waveform_gap_start_index = 0;
static uint16_t waveform_gap_end_index = 0;
static uint16_t waveform_main_start_index = 0;
static uint16_t waveform_main_end_index = 0;

/* Exact firmware phase boundary timestamps (absolute micros_now() domain). */
static uint32_t wf_preheat_start_us = 0;
static uint32_t wf_preheat_end_us = 0;
static uint32_t wf_gap_start_us = 0;
static uint32_t wf_gap_end_us = 0;
static uint32_t wf_main_start_us = 0;
static uint32_t wf_main_end_us = 0;

/* Cached once before each pulse to avoid slow 16x averaged voltage reads during
 * 200us sampling. */
static float cached_vcap = 0.0f;

/* ADC1 mode tracking so fast pulse sampling can run without per-sample
 * reconfiguration jitter. */
static bool adc1_fast_current_mode = false;
static bool adc2_fast_vcap_mode = false;
static uint32_t adc1_fast_rank1_channel = 0U;
static uint32_t adc1_fast_rank2_channel = 0U;

/* ============ Contact trigger state ============ */
static bool contact_hold_active = false;
static uint32_t contact_hold_start_ms = 0;
static bool contact_fire_lock = false;

/* ==== Voltage-based contact detection state (AMC1311B vcap) ==== */
static float g_contact_threshold_v = 1.5f;
static bool g_contact_state = false;
static bool g_contact_pending_high = false;
static uint32_t g_contact_pending_since_ms = 0;
static uint32_t g_contact_last_sample_ms = 0;
static float g_contact_last_vcap = 0.0f;

/* ============ INA226 state (CONTROL SYSTEM) ============ */
static volatile bool ina226_ok = false;
static float ina_vpack = 0.0f;
static float vlow = 0.0f;      /* TAP_LOW  (0x41) – bottom of stack */
static float vmid = 0.0f;      /* TAP_MID  (0x44) – middle tap      */
static float ina_cell1 = 0.0f; /* Bottom cell: vlow                  */
static float ina_cell2 = 0.0f; /* Middle cell: vmid - vlow           */
static float ina_cell3 = 0.0f; /* Top cell:    vpack - vmid          */
static float ina_ichg = 0.0f;

/* ============ Charger state ============ */
static bool charger_enabled = false;

/* 🔴 Charger lockout (post-weld) */
static bool charger_lockout = false;
static uint32_t charger_lockout_until = 0;

/* ============ UART RX Buffer ============ */
#define RX_LINE_MAX 128
static uint8_t rx_byte;
static char rx_build[RX_LINE_MAX];
static uint8_t rx_idx = 0;
static char rx_ready[RX_LINE_MAX];
static volatile bool rx_line_ready = false;

/* ============ UART debug ============ */
#define DEBUG_UART_RX 1
static volatile uint32_t uart_rx_bytes = 0;
static volatile uint32_t uart_rx_errors = 0;
static volatile uint32_t uart_rx_overruns = 0;

/* ============ INA226 Bare-Metal I2C Driver ============ */

