farmertan81/Spot-Welder/STM32G474CE/src/main.c
static bool ina226_write_reg(uint8_t addr, uint8_t reg, uint16_t val) {
    uint8_t data[2];
    data[0] = (val >> 8) & 0xFF;
    data[1] = val & 0xFF;
    HAL_StatusTypeDef st = HAL_I2C_Mem_Write(&hi2c1, (uint16_t)(addr << 1), reg,
                                             I2C_MEMADD_SIZE_8BIT, data, 2, 10);
    return (st == HAL_OK);
}

static bool ina226_read_reg(uint8_t addr, uint8_t reg, uint16_t* val) {
    uint8_t data[2];
    HAL_StatusTypeDef st = HAL_I2C_Mem_Read(&hi2c1, (uint16_t)(addr << 1), reg,
                                            I2C_MEMADD_SIZE_8BIT, data, 2, 10);
    if (st != HAL_OK) return false;
    *val = ((uint16_t)data[0] << 8) | data[1];
    return true;
}

static bool ina226_read_bus_voltage(uint8_t addr, float* voltage) {
    uint16_t raw;
    if (!ina226_read_reg(addr, INA226_REG_BUS_V, &raw)) return false;
    *voltage = raw * 0.00125f; /* 1.25 mV/bit */
    return true;
}

static bool ina226_read_shunt_current(uint8_t addr, float* current) {
    uint16_t raw;
    if (!ina226_read_reg(addr, INA226_REG_SHUNT_V, &raw)) return false;
    int16_t signed_raw = (int16_t)raw;
    float shunt_voltage_v = signed_raw * 0.0000025f; /* 2.5 µV/bit */
    float calculated_current = shunt_voltage_v / INA226_SHUNT_R;
    *current = (-calculated_current) * CHARGE_CURRENT_CORRECTION;
    if (fabsf(*current) < 0.010f) *current = 0.0f;
    if (*current > 50.0f) *current = 50.0f;
    return true;
}

static bool ina226_health_check(void) {
    /* Verify all three sensors respond using HAL_I2C_IsDeviceReady (3 trials,
     * 10ms) */
    if (HAL_I2C_IsDeviceReady(&hi2c1, (uint16_t)(INA226_ADDR_PACK << 1), 3,
                              10) != HAL_OK)
        return false;
    if (HAL_I2C_IsDeviceReady(&hi2c1, (uint16_t)(INA226_ADDR_NODE1 << 1), 3,
                              10) != HAL_OK)
        return false;
    if (HAL_I2C_IsDeviceReady(&hi2c1, (uint16_t)(INA226_ADDR_NODE2 << 1), 3,
                              10) != HAL_OK)
        return false;
    return true;
}

static void ina226_read_all(void) {
    /* Step 1: Verify all three sensors are present on the bus */
    if (!ina226_health_check()) {
        ina226_ok = false;
        /* Safety: disable charger if any sensor missing */
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    float vp = 0, vl = 0, vm = 0, ichg = 0;
    bool ok = true;

    if (!ina226_read_bus_voltage(INA226_ADDR_PACK, &vp)) ok = false;
    if (!ina226_read_bus_voltage(INA226_ADDR_NODE1, &vl)) ok = false;
    if (!ina226_read_bus_voltage(INA226_ADDR_NODE2, &vm)) ok = false;
    if (!ina226_read_shunt_current(INA226_ADDR_PACK, &ichg)) ok = false;

    ina226_ok = ok;

    if (!ok) {
        /* Safety: disable charger on read failure */
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    ina_vpack = vp * VPACK_SCALE;
    vlow = vl * V_NODE1_SCALE;
    vmid = vm * V_NODE2_SCALE;

    /* Correct cell voltage math:
     * [Pack-] ── Cell_Bot ── (vlow/0x41) ── Cell_Mid ── (vmid/0x44) ── Cell_Top
     * ── [Pack+]
     */
    ina_cell1 = vlow;             /* Bottom cell */
    ina_cell2 = vmid - vlow;      /* Middle cell */
    ina_cell3 = ina_vpack - vmid; /* Top cell    */

    ina_ichg = ichg;
}

/* ============ Charger State Machine (INA226 ONLY) ============ */

static void chargerStateMachine(void) {
    uint32_t now = HAL_GetTick();

    /* 🔴 LOCKOUT: block charger after weld */
    if (charger_lockout) {
        if ((int32_t)(now - charger_lockout_until) >= 0) {
            charger_lockout = false;  // release lock
        } else {
            HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
            charger_enabled = false;
            return;
        }
    }

    /* SAFETY: INA226 failure → charger OFF */
    if (!ina226_ok) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    /* DISARMED → charger OFF */
    if (!armed) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    /* WELDING → charger OFF */
    if (welding_now) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    /* NORMAL HYSTERESIS CONTROL */
    if (ina_vpack >= CHG_VPACK_OFF) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
    } else if (ina_vpack <= CHG_VPACK_ON) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_SET);
        charger_enabled = true;
    }
}

/* ============ UART Status Packets (split into two for ESP32 parsing)
 * ============ */

static void sendStatusPacket(void) {
    char buf[512];

    /* --- Packet 1: STATUS (system state + full runtime recipe/settings) --- */
    float vcap = readCapVoltage();
    float power_f = (float)weld_power_pct;

    if (control_mode == 1U) {
        const char* joule_status = "RUNNING";
        if (joule_target_reached) {
            joule_status = "OK";
        } else if (joule_timeout_abort) {
            joule_status = "TIMEOUT";
        } else if (joule_bad_contact_abort) {
            joule_status = "BAD_CONTACT";
        }

        /* joule_actual is workpiece energy (lead-compensated control variable).
         * Debug fields show total source energy and estimated lead-loss energy.
         */
        snprintf(buf, sizeof(buf),
                 "STATUS,armed=%d,ready=%d,welding=%d,vcap=%.2f,"
                 "temp=%.2f,mode=%d,d1=%u,gap1=%u,d2=%u,gap2=%u,d3=%u,"
                 "power=%.2f,preheat_en=%d,preheat_ms=%u,preheat_pct=%u,"
                 "preheat_gap_ms=%u,trigger_mode=%u,contact_hold_steps=%u,"
                 "contact_with_pedal=%u,vdda=%.3f,lead_r_ohm=%.6f,"
                 "control_mode=%u,joule_target_j=%.1f,joule_target=%.1f,joule_"
                 "actual=%.1f,"
                 "joule_total=%.1f,joule_lead_loss=%.1f,"
                 "joule_duration_ms=%lu,joule_status=%s,joule_max_ms=%lu",
                 armed ? 1 : 0, system_ready ? 1 : 0, welding_now ? 1 : 0, vcap,
                 temp_filtered_c, (int)weld_mode, (unsigned)weld_d1_ms,
                 (unsigned)weld_gap1_ms, (unsigned)weld_d2_ms,
                 (unsigned)weld_gap2_ms, (unsigned)weld_d3_ms, power_f,
                 preheat_enabled ? 1 : 0, (unsigned)preheat_ms,
                 (unsigned)preheat_pct, (unsigned)preheat_gap_ms,
                 (unsigned)trigger_mode, (unsigned)contact_hold_steps,
                 (unsigned)contact_with_pedal, measured_vdda,
                 lead_resistance_ohms, (unsigned)control_mode, joule_target_j,
                 joule_target_j, joule_accumulated, joule_total_accumulated,
                 joule_lead_loss_accumulated,
                 (unsigned long)(joule_actual_duration_us / 1000U),
                 joule_status, (unsigned long)joule_max_ms);
    } else {
        snprintf(buf, sizeof(buf),
                 "STATUS,armed=%d,ready=%d,welding=%d,vcap=%.2f,"
                 "temp=%.2f,mode=%d,d1=%u,gap1=%u,d2=%u,gap2=%u,d3=%u,"
                 "power=%.2f,preheat_en=%d,preheat_ms=%u,preheat_pct=%u,"
                 "preheat_gap_ms=%u,trigger_mode=%u,contact_hold_steps=%u,"
                 "contact_with_pedal=%u,vdda=%.3f,lead_r_ohm=%.6f,"
                 "control_mode=%u,joule_target_j=%.1f,joule_max_ms=%lu",
                 armed ? 1 : 0, system_ready ? 1 : 0, welding_now ? 1 : 0, vcap,
                 temp_filtered_c, (int)weld_mode, (unsigned)weld_d1_ms,
                 (unsigned)weld_gap1_ms, (unsigned)weld_d2_ms,
                 (unsigned)weld_gap2_ms, (unsigned)weld_d3_ms, power_f,
                 preheat_enabled ? 1 : 0, (unsigned)preheat_ms,
                 (unsigned)preheat_pct, (unsigned)preheat_gap_ms,
                 (unsigned)trigger_mode, (unsigned)contact_hold_steps,
                 (unsigned)contact_with_pedal, measured_vdda,
                 lead_resistance_ohms, (unsigned)control_mode, joule_target_j,
                 (unsigned long)joule_max_ms);
    }
    uartSend(buf);

