farmertan81/Spot-Welder/STM32G474CE/src/main.c
    /* --- Packet 2: STATUS2 (INA226 telemetry) --- */
    snprintf(buf, sizeof(buf),
             "STATUS2,ina_ok=%d,chg_en=%d,vpack=%.2f,vlow=%.2f,"
             "vmid=%.2f,cell1=%.2f,cell2=%.2f,cell3=%.2f,ichg=%.2f",
             ina226_ok ? 1 : 0, charger_enabled ? 1 : 0, ina_vpack, vlow, vmid,
             ina_cell1, ina_cell2, ina_cell3, ina_ichg);
    uartSend(buf);
}

/* ============ Shunt Sensing Functions ============ */
static uint32_t adcReadSingleConfigured(ADC_HandleTypeDef* hadc,
                                        uint32_t timeout_ms) {
    HAL_ADC_Start(hadc);
    if (HAL_ADC_PollForConversion(hadc, timeout_ms) != HAL_OK) {
        HAL_ADC_Stop(hadc);
        return 0xFFFF;
    }

    uint32_t val = HAL_ADC_GetValue(hadc);
    HAL_ADC_Stop(hadc);
    return val;
}

static uint32_t adcReadChannelWithTiming(ADC_HandleTypeDef* hadc,
                                         uint32_t channel,
                                         uint32_t sampling_time,
                                         uint32_t timeout_ms) {
    if (hadc == &hadc1 && adc1_fast_current_mode) {
        HAL_ADC_Stop(&hadc1);
        hadc1.Init.ScanConvMode = ADC_SCAN_DISABLE;
        hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
        hadc1.Init.NbrOfConversion = 1;
        if (HAL_ADC_Init(&hadc1) != HAL_OK) {
            return 0xFFFF;
        }
        adc1_fast_current_mode = false;
    }

    ADC_ChannelConfTypeDef sConfig = {0};
    sConfig.Channel = channel;
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = sampling_time;
    sConfig.SingleDiff = ADC_SINGLE_ENDED;
    sConfig.OffsetNumber = ADC_OFFSET_NONE;
    sConfig.Offset = 0;

    if (HAL_ADC_ConfigChannel(hadc, &sConfig) != HAL_OK) {
        return 0xFFFF;
    }

    return adcReadSingleConfigured(hadc, timeout_ms);
}

static uint32_t adcChannelEnumToNumber(uint32_t channel_enum) {
    switch (channel_enum) {
        case ADC_CHANNEL_1:
            return 1U;
        case ADC_CHANNEL_2:
            return 2U;
        case ADC_CHANNEL_3:
            return 3U;
        case ADC_CHANNEL_4:
            return 4U;
        case ADC_CHANNEL_5:
            return 5U;
        case ADC_CHANNEL_6:
            return 6U;
        case ADC_CHANNEL_7:
            return 7U;
        case ADC_CHANNEL_8:
            return 8U;
        case ADC_CHANNEL_9:
            return 9U;
        case ADC_CHANNEL_10:
            return 10U;
        case ADC_CHANNEL_11:
            return 11U;
        case ADC_CHANNEL_12:
            return 12U;
        case ADC_CHANNEL_13:
            return 13U;
        case ADC_CHANNEL_14:
            return 14U;
        case ADC_CHANNEL_15:
            return 15U;
        case ADC_CHANNEL_16:
            return 16U;
        case ADC_CHANNEL_17:
            return 17U;
        case ADC_CHANNEL_18:
            return 18U;
#ifdef ADC_CHANNEL_VREFINT
        case ADC_CHANNEL_VREFINT:
            return 18U;
#endif
#ifdef ADC_CHANNEL_TEMPSENSOR
        case ADC_CHANNEL_TEMPSENSOR:
            return 16U;
#endif
        default:
            return 0U;
    }
}

static void adcPrepareVcapNChannel(void) {
    adc2_fast_vcap_mode = false;
    HAL_ADC_Stop(&hadc2);

    ADC_ChannelConfTypeDef sConfig = {0};
    sConfig.Channel = ADC_CHANNEL_17;
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_47CYCLES_5;
    sConfig.SingleDiff = ADC_SINGLE_ENDED;
    sConfig.OffsetNumber = ADC_OFFSET_NONE;
    sConfig.Offset = 0;

    if (HAL_ADC_ConfigChannel(&hadc2, &sConfig) != HAL_OK) {
        uartSend("DENY,ADC2_CH17_CFG_FAIL\r\n");
        return;
    }
    adc2_fast_vcap_mode = true;
}

static void adcPrepareFastCurrentChannels(void) {
    ADC_ChannelConfTypeDef sConfig = {0};

    /* Stop ADC first */
    HAL_ADC_Stop(&hadc1);

    adc1_fast_current_mode = false;
    adc1_fast_rank1_channel = 0U;
    adc1_fast_rank2_channel = 0U;

    /* Configure for scan mode with 3 channels */
    hadc1.Init.ScanConvMode = ADC_SCAN_ENABLE;
    hadc1.Init.ContinuousConvMode = DISABLE;
    hadc1.Init.DiscontinuousConvMode =
        DISABLE; /* NOT needed for register read */
    hadc1.Init.NbrOfConversion = 3;
    hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;

    if (HAL_ADC_Init(&hadc1) != HAL_OK) {
        uartSend("DENY,ADC_INIT_FAIL");
        return;
    }

    /* Configure Channel 2 (P) - Rank 1 */
    sConfig.Channel = ADC_CHANNEL_2;
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_47CYCLES_5;
    sConfig.SingleDiff = ADC_SINGLE_ENDED;
    sConfig.OffsetNumber = ADC_OFFSET_NONE;
    sConfig.Offset = 0;

    if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
        uartSend("DENY,CH2_CFG_FAIL");
        return;
    }
    adc1_fast_rank1_channel = adcChannelEnumToNumber(sConfig.Channel);

#if ADC_PAIR_VERBOSE_DEBUG
    uartSend("DBG,ADC_CH_SET,rank=1,channel=2\r\n");
#endif

    /* Configure Channel 3 (N) - Rank 2 */
    sConfig.Channel = ADC_CHANNEL_3;
    sConfig.Rank = ADC_REGULAR_RANK_2;
    sConfig.SamplingTime = ADC_SAMPLETIME_47CYCLES_5;
    sConfig.SingleDiff = ADC_SINGLE_ENDED;

    if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
        uartSend("DENY,CH3_CFG_FAIL");
        return;
    }
    adc1_fast_rank2_channel = adcChannelEnumToNumber(sConfig.Channel);

#if ADC_PAIR_VERBOSE_DEBUG
    uartSend("DBG,ADC_CH_SET,rank=2,channel=3\r\n");
#endif

    /* Configure Channel 4 (V_cap+) - Rank 3 */
    sConfig.Channel = ADC_CHANNEL_4;  // PA3 = AMC1311B CAP OUTP
    sConfig.Rank = ADC_REGULAR_RANK_3;
    sConfig.SamplingTime = ADC_SAMPLETIME_47CYCLES_5;
    sConfig.SingleDiff = ADC_SINGLE_ENDED;
    if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) {
        uartSend("DENY,CH4_CFG_FAIL\r\n");
        return;
    }

#if ADC_PAIR_VERBOSE_DEBUG
    uartSend("DBG,ADC_CH_SET,rank=3,channel=4\r\n");
    uartSend("DBG,ADC_CFG,mode=register,scan=1,nbr=3,disc=0\r\n");
#endif

    adc1_fast_current_mode = true;
#if ADC_PAIR_VERBOSE_DEBUG
    uartSend("DBG,ADC_FAST_MODE_OK\r\n");
#endif

    adcPrepareVcapNChannel(); /* Pre-configure ADC2 for fast V_cap- reads */
}

/* Fast-path weld current read using register-level ADC access. */
static bool adcReadFastCurrentPair(uint32_t* out_p, uint32_t* out_n) {
    if (!out_p || !out_n) {
        return false;
    }

    *out_p = 0U;
    *out_n = 0U;

    /* Verify fast mode is enabled */
    if (!adc1_fast_current_mode) {
        return false;
    }

