farmertan81/Spot-Welder/STM32G474CE/src/main.c
    bool preheat_debug_ready = false;
    uint16_t preheat_debug_cfg_ms = 0U;
    uint16_t preheat_debug_duty = 0U;
    uint16_t preheat_debug_start_idx = 0U;
    uint16_t preheat_debug_end_idx = 0U;

    bool gap_debug_ready = false;
    uint16_t gap_debug_cfg_ms = 0U;
    uint32_t gap_debug_start_us = 0U;
    uint32_t gap_debug_end_us = 0U;
    uint16_t gap_debug_planned_samples = 0U;
    uint16_t gap_debug_start_idx = 0U;
    uint16_t gap_debug_end_idx = 0U;

    /* === Execute weld pulse (HRTIM/PWM code UNTOUCHED) === */
    if (preheat_enabled && preheat_ms > 0) {
        uint16_t preheat_start_idx = waveform_index;
        waveform_preheat_start_index = preheat_start_idx;
        uint16_t preheat_duty = pctToDuty(preheat_pct);
        uint16_t preheat_linear_duty =
            (uint16_t)(((uint32_t)preheat_pct * PWM_MAX) / 100U);

#if ADC_PAIR_VERBOSE_DEBUG
        {
            char cdbg[160];
            snprintf(
                cdbg, sizeof(cdbg),
                "DBG,PWM_COMP,phase=preheat,pct=%u,linear_duty=%u,comp_duty=%u",
                (unsigned int)preheat_pct, (unsigned int)preheat_linear_duty,
                (unsigned int)preheat_duty);
            uartSend(cdbg);
        }
#endif

        uint16_t preheat_end_idx = waveform_index;
        (void)doPulseMsPwm(preheat_ms, preheat_duty, &wf_preheat_start_us,
                           &wf_preheat_end_us, &preheat_end_idx);

        {
            uint32_t aligned_preheat_start_us = 0U;
            if (resolve_phase_start_from_waveform(preheat_start_idx,
                                                  preheat_end_idx,
                                                  &aligned_preheat_start_us)) {
                wf_preheat_start_us = aligned_preheat_start_us;
            }

            uint32_t aligned_preheat_end_us = 0U;
            if (resolve_phase_end_from_waveform(preheat_start_idx,
                                                preheat_end_idx,
                                                &aligned_preheat_end_us)) {
                wf_preheat_end_us = aligned_preheat_end_us;
            }

            waveform_preheat_end_index = preheat_end_idx;
            waveform_gap_start_index = preheat_end_idx;
            waveform_gap_end_index = preheat_end_idx;
            preheat_debug_ready = true;
            preheat_debug_cfg_ms = preheat_ms;
            preheat_debug_duty = preheat_duty;
            preheat_debug_start_idx = preheat_start_idx;
            preheat_debug_end_idx = preheat_end_idx;
        }

        wf_gap_start_us = wf_preheat_end_us;
        wf_gap_end_us = wf_preheat_end_us;

        if (preheat_gap_ms > 0U) {
            pwmOff(); /* belt-and-suspenders: ISR already killed FET */
            uint32_t actual_pwm_off_us = micros_now();

            wf_gap_start_us = actual_pwm_off_us;
            wf_gap_end_us = actual_pwm_off_us;

            uint32_t gap_start_us = wf_gap_start_us;
            uint16_t gap_start_idx = waveform_index;
            waveform_gap_start_index = gap_start_idx;
            uint16_t planned_gap_samples =
                (uint16_t)(((uint32_t)preheat_gap_ms * 1000U) /
                           WAVEFORM_SAMPLE_INTERVAL_US);

            /*
             * Hardware timer delay for inter-pulse gap control.
             * We pre-subtract known fixed bookkeeping overhead so the
             * scope-measured preheat->main gap matches configured gap_ms.
             * All post-gap bookkeeping is done AFTER the delay returns;
             * the main-pulse TIM2+pwmOn is launched from doPulseMsPwm()
             * with back-to-back register writes for tight timing.
             */
            uint32_t gap_us = (uint32_t)preheat_gap_ms * 1000U;
            if (gap_us > GAP_TIMING_COMPENSATION_US) {
                gap_us -= GAP_TIMING_COMPENSATION_US;
            } else {
                gap_us = 0U;  // avoid underflow for very short gaps
            }
            tim2_delay_us(gap_us);
            wf_gap_end_us = micros_now();

            uint16_t gap_end_idx = waveform_index;
            waveform_gap_end_index = gap_end_idx;

            gap_debug_ready = true;
            gap_debug_cfg_ms = preheat_gap_ms;
            gap_debug_start_us = gap_start_us;
            gap_debug_end_us = wf_gap_end_us;
            gap_debug_planned_samples = planned_gap_samples;
            gap_debug_start_idx = gap_start_idx;
            gap_debug_end_idx = gap_end_idx;
        }
    }

    /*
     * Pre-compute main pulse duty BEFORE the gap ends so the path from
     * gap-timer-expiry → main-pulse-FET-on is as short as possible.
     * (Moved out of the critical timing path.)
     */
    uint16_t mainDuty = pctToDuty(weld_power_pct);
    uint16_t main_linear_duty =
        (uint16_t)(((uint32_t)weld_power_pct * PWM_MAX) / 100U);
    bool joule_stop_requested =
        (control_mode == 1U) && (joule_target_reached || joule_timeout_abort ||
                                 joule_bad_contact_abort);

    /* ── JOULE MODE: single energy-controlled pulse ──────────────────────
     * In JOULE mode the weld is ONE continuous pulse that runs until the
     * measured WORKPIECE energy reaches the target (checked sample-by-sample
     * inside capturePulseAmpsForDurationUs), capped by joule_max_ms as a
     * safety limit. The Pulse-tab time durations (d1/d2/d3) and the gap/
     * multi-phase structure do NOT apply. We therefore fire phase 1 for
     * joule_max_ms (the energy condition stops it early when the target is
     * met) and skip phases 2 and 3 entirely.
     *
     * BUGFIX: previously phase 1 fired for weld_d1_ms (a time-mode setting),
     * so with high lead losses the pulse ended before the workpiece reached
     * the target — delivering less energy than requested (e.g. 34J of a 50J
     * target). Driving the pulse from joule_max_ms lets the energy integrator
     * actually reach the target. */
    const bool joule_mode = (control_mode == 1U);
    uint16_t joule_pulse_ms = (uint16_t)joule_max_ms;
    if (joule_pulse_ms > MAX_WELD_MS) joule_pulse_ms = MAX_WELD_MS;
    const uint16_t main1_ms = joule_mode ? joule_pulse_ms : weld_d1_ms;

