farmertan81/Spot-Welder/STM32G474CE/src/main.c
            if (pulse_start_index >= waveform_index) {
                pulse_start_index = (uint16_t)(waveform_index - 1U);
            }
            if (pulse_end_index_exclusive > waveform_index) {
                pulse_end_index_exclusive = waveform_index;
            }
            if (pulse_end_index_exclusive < pulse_start_index) {
                pulse_end_index_exclusive = pulse_start_index;
            }

            if (pulse_end_index_exclusive > pulse_start_index) {
                uint16_t pulse_last_index =
                    (uint16_t)(pulse_end_index_exclusive - 1U);
                uint32_t pulse_start_us =
                    waveform_buffer[pulse_start_index].timestamp_us;
                uint32_t pulse_end_us =
                    waveform_buffer[pulse_last_index].timestamp_us;

                if (pulse_end_index_exclusive < waveform_index) {
                    uint32_t next_us =
                        waveform_buffer[pulse_end_index_exclusive].timestamp_us;
                    if (next_us > pulse_end_us) {
                        pulse_end_us = next_us;
                    } else {
                        pulse_end_us += WAVEFORM_SAMPLE_INTERVAL_US;
                    }
                } else {
                    pulse_end_us += WAVEFORM_SAMPLE_INTERVAL_US;
                }

                uint32_t waveform_window_us =
                    (pulse_end_us >= pulse_start_us)
                        ? (pulse_end_us - pulse_start_us)
                        : 0U;
                if (waveform_window_us > pulse_duration_us) {
                    pulse_duration_us = waveform_window_us;
                }
            }
        }

        total_ms = (pulse_duration_us + 500U) / 1000U;

        uint32_t capture_ms =
            ((uint32_t)WAVEFORM_PRE_SAMPLES * WAVEFORM_SAMPLE_INTERVAL_US +
             (uint32_t)planned_pulse_ms * 1000U +
             (uint32_t)WAVEFORM_POST_SAMPLES * WAVEFORM_SAMPLE_INTERVAL_US +
             500U) /
            1000U;

#if ADC_PAIR_VERBOSE_DEBUG
        char tdbg[224];
        snprintf(tdbg, sizeof(tdbg),
                 "DBG,WAVEFORM_TIMING,pulse_ms=%lu,pulse_us=%lu,capture_ms=%lu,"
                 "wf_samples=%"
                 "u,planned_samples=%lu,pulse_start_idx=%u,pulse_end_idx=%u",
                 (unsigned long)total_ms, (unsigned long)pulse_duration_us,
                 (unsigned long)capture_ms, (unsigned int)waveform_index,
                 (unsigned long)planned_total_samples,
                 (unsigned int)waveform_pulse_start_index,
                 (unsigned int)waveform_pulse_end_index);
        uartSend(tdbg);
#endif
    }

#if ADC_PAIR_VERBOSE_DEBUG
    if (preheat_debug_ready) {
        uint16_t preheat_samples =
            (preheat_debug_end_idx >= preheat_debug_start_idx)
                ? (uint16_t)(preheat_debug_end_idx - preheat_debug_start_idx)
                : 0U;
        float preheat_max_amps = 0.0f;
        float preheat_sum_amps = 0.0f;
        for (uint16_t i = preheat_debug_start_idx; i < preheat_debug_end_idx;
             i++) {
            float a = waveform_buffer[i].current_amps;
            if (a > preheat_max_amps) preheat_max_amps = a;
            preheat_sum_amps += a;
        }
        float preheat_avg_amps =
            (preheat_samples > 0U) ? (preheat_sum_amps / (float)preheat_samples)
                                   : 0.0f;

        char pdbg[220];
        snprintf(pdbg, sizeof(pdbg),
                 "DBG,PREHEAT_CAPTURE_END,cfg_ms=%u,duty=%u,samples=%u,"
                 "start_idx=%u,end_idx=%u,avg_a=%.2f,max_a=%.2f",
                 (unsigned int)preheat_debug_cfg_ms,
                 (unsigned int)preheat_debug_duty,
                 (unsigned int)preheat_samples,
                 (unsigned int)preheat_debug_start_idx,
                 (unsigned int)preheat_debug_end_idx, preheat_avg_amps,
                 preheat_max_amps);
        uartSend(pdbg);
    }
#endif

#if ADC_PAIR_VERBOSE_DEBUG
    if (gap_debug_ready) {
        uint16_t captured_gap_samples =
            (gap_debug_end_idx >= gap_debug_start_idx)
                ? (uint16_t)(gap_debug_end_idx - gap_debug_start_idx)
                : 0U;

        float gap_max_amps = 0.0f;
        float gap_sum_amps = 0.0f;
        for (uint16_t i = gap_debug_start_idx; i < gap_debug_end_idx; i++) {
            float a = waveform_buffer[i].current_amps;
            if (a > gap_max_amps) gap_max_amps = a;
            gap_sum_amps += a;
        }
        float gap_avg_amps = (captured_gap_samples > 0U)
                                 ? (gap_sum_amps / (float)captured_gap_samples)
                                 : 0.0f;

        char gdbg_start[140];
        snprintf(gdbg_start, sizeof(gdbg_start),
                 "DBG,PREHEAT_GAP_START,cfg_ms=%u,start_us=%lu,mosfet=OFF,"
                 "planned_samples=%u",
                 (unsigned int)gap_debug_cfg_ms,
                 (unsigned long)gap_debug_start_us,
                 (unsigned int)gap_debug_planned_samples);
        uartSend(gdbg_start);

        char gdbg_end[196];
        snprintf(gdbg_end, sizeof(gdbg_end),
                 "DBG,PREHEAT_GAP_END,cfg_ms=%u,actual_us=%lu,captured_samples="
                 "%u,avg_a=%.2f,max_a=%.2f,mosfet=OFF",
                 (unsigned int)gap_debug_cfg_ms,
                 (unsigned long)(gap_debug_end_us - gap_debug_start_us),
                 (unsigned int)captured_gap_samples, gap_avg_amps,
                 gap_max_amps);
        uartSend(gdbg_end);
    }
#endif

#if ADC_PAIR_VERBOSE_DEBUG
    {
        char cdbg[160];
        snprintf(cdbg, sizeof(cdbg),
                 "DBG,PWM_COMP,phase=main,pct=%u,linear_duty=%u,comp_duty=%u",
                 (unsigned int)weld_power_pct, (unsigned int)main_linear_duty,
                 (unsigned int)mainDuty);
        uartSend(cdbg);
    }
#endif

    welding_now = false;
    last_weld_ms = HAL_GetTick();

    /* 🔴 Engage post-weld lockout (atomic pair update) */
    __disable_irq();
    charger_lockout = true;
    charger_lockout_until = HAL_GetTick() + 500;
    __enable_irq();

    /* Step 5: Wait for post-pulse voltage to settle before V_after capture.
     * Immediate reading includes transient ESR/lead bounce and biases ΔV high.
     * Use 20-50ms window; 30ms is a good compromise for stable settled value.
     */
    const uint32_t vcap_settle_delay_ms = 30U;
    HAL_Delay(vcap_settle_delay_ms);

    /* Step 6: ADC diagnostic snapshot AFTER weld (settled) */
    cal_vcap_after = readCapVoltage();

    /* Voltage overlay: hold pre-pulse at vcap_before, interpolate during active
     * pulse window, then hold post-pulse at vcap_after. */
    apply_waveform_voltage_interpolation(cal_vcap_before, cal_vcap_after,
                                         waveform_pulse_start_index,
                                         waveform_pulse_end_index);
#if ADC_PAIR_VERBOSE_DEBUG
    {
        char vdbg[160];
        snprintf(
            vdbg, sizeof(vdbg),
            "DBG,WAVEFORM_VOLTAGE,method=pre_hold_pulse_interp_post_hold,start="
            "%.3f,end=%.3f,count=%u,pulse_start_idx=%u,pulse_end_idx=%u",
            cal_vcap_before, cal_vcap_after, (unsigned int)waveform_index,
            (unsigned int)waveform_pulse_start_index,
            (unsigned int)waveform_pulse_end_index);
        uartSend(vdbg);
    }
#endif

    /* Recompute pulse statistics from actual captured pulse window.
     * waveform_pulse_* indices are [start, end) (end is exclusive). */
    uint16_t pulse_start_sample = waveform_pulse_start_index;
    uint16_t pulse_end_sample = waveform_pulse_end_index;
    if (pulse_start_sample > waveform_index) {
        pulse_start_sample = waveform_index;
    }
    if (pulse_end_sample > waveform_index) {
        pulse_end_sample = waveform_index;
    }
    if (pulse_end_sample < pulse_start_sample) {
        pulse_end_sample = pulse_start_sample;
    }

    float pulse_sum_current = 0.0f;
    float pulse_sum_voltage = 0.0f;
    uint32_t pulse_count = 0U;

