farmertan81/Spot-Welder/STM32G474CE/src/main.c
    /* Software bootloader entry: if the "BOOTLOADER" UART command requested an
     * update, requestBootloaderReset() stored a magic value in a backup register
     * and reset the MCU (which also stopped the IWDG). Detect that here - BEFORE
     * the clocks/peripherals are configured and BEFORE MX_IWDG_Init() re-arms the
     * watchdog - clear the flag, and jump straight into the ROM bootloader. */
    bootloaderEnableBackupAccess();
    if (BOOTLOADER_FLAG_REG == BOOTLOADER_REQUEST_MAGIC) {
        BOOTLOADER_FLAG_REG = 0;   /* one-shot: clear so we boot normally next time */
        __DSB();
        jumpToBootloader();        /* does not return */
    }

    SystemClock_Config();
    SystemCoreClockUpdate();
    HAL_InitTick(TICK_INT_PRIORITY);

    /* Enable DWT cycle counter for microsecond timestamps used by waveform
     * capture. */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    MX_GPIO_Init();

    /* 100ms delay for INA226 power rail stabilization */
    HAL_Delay(100);

    for (int i = 0; i < 3; i++) {
        HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
        HAL_Delay(80);
    }

    /* I2C bus recovery before initialization – unstick any hung devices */
    i2c_bus_recovery();

    MX_I2C1_Init(); /* I2C1 for INA226 sensors – graceful, no hang */
    MX_USART1_UART_Init();

    persistent_defaults(&g_persistent_settings);
    flash_settings_init();
    bool load_ok = flash_settings_load(&g_persistent_settings);
    if (load_ok) {
        apply_loaded_settings(&g_persistent_settings);
    } else {
        persistent_defaults(&g_persistent_settings);
        apply_loaded_settings(&g_persistent_settings);
        uartSend("WARN,FLASH_LOAD_FAILED,USING_DEFAULTS");
    }

    {
        char buf[128];
        snprintf(buf, sizeof(buf),
                 "DBG,BOOT,control_mode=%d,joule_target_j=%.1f", control_mode,
                 joule_target_j);
        uartSend(buf);
    }

    MX_ADC1_Init();
    OPAMP1->CSR &= ~OPAMP_CSR_OPAMPxEN;
    MX_ADC2_Init(); /* ADC2 for PA4 (AMC1311B OUTN = ADC2_IN17) */
    MX_TIM1_Init();
    init_tim2_1mhz();

    /* Initial VDDA calibration using VREFINT */
    measured_vdda = measureVDDA();

    /* One-time boot pre-configuration for fast current channels.
     * Weld path re-validates this before entering the hot sampling loop. */
    adcPrepareFastCurrentChannels();

    HAL_TIM_PWM_Start_IT(&htim1, TIM_CHANNEL_1);
    pwmOff();

    boot_ms = HAL_GetTick();

    /* Trigger mode and other runtime settings are now restored from flash. */

    g_contact_threshold_v = CONTACT_THRESHOLD_V_DEFAULT;
    g_contact_state = false;
    g_contact_pending_high = false;
    g_contact_pending_since_ms = 0;
    g_contact_last_sample_ms = 0;
    g_contact_last_vcap = 0.0f;
    GPIO_PinState r = HAL_GPIO_ReadPin(PEDAL_PORT, PEDAL_PIN);
    pedal_last_raw = r;
    pedal_stable = r;
    pedal_last_change_ms = boot_ms;

    /* NEW: Initialize INA226 sensors */
    {
        /* INA226 0x40 (pack): reset + configure */
        ina226_write_reg(INA226_ADDR_PACK, INA226_REG_CONFIG, 0x8000);
        HAL_Delay(20);
        /* CONFIG: AVG=64, VBUSCT=1.1ms, VSHCT=1.1ms, MODE=cont shunt+bus
         * AVG=64 (0x03<<9) gives √64=8x noise reduction vs single sample.
         * Previous AVG=16 had ~10mV noise on cell1; 64 should cut to ~2-3mV.
         * Update period: 64 × 1.1ms × 2 ≈ 141ms (still within 100ms loop). */
        uint16_t ina_config = (0x03 << 9) | (0x04 << 6) | (0x04 << 3) | 0x07;
        ina226_write_reg(INA226_ADDR_PACK, INA226_REG_CONFIG, ina_config);
        HAL_Delay(10);
        /* Calibration register (same as ESP32 used) */
        ina226_write_reg(INA226_ADDR_PACK, INA226_REG_CALIBRATION, 41967);
        HAL_Delay(10);

        /* INA226 0x41 (node1): reset + configure (bus voltage only) */
        ina226_write_reg(INA226_ADDR_NODE1, INA226_REG_CONFIG, 0x8000);
        HAL_Delay(20);
        ina226_write_reg(INA226_ADDR_NODE1, INA226_REG_CONFIG, ina_config);
        HAL_Delay(10);

        /* INA226 0x44 (node2): reset + configure (bus voltage only) */
        ina226_write_reg(INA226_ADDR_NODE2, INA226_REG_CONFIG, 0x8000);
        HAL_Delay(20);
        ina226_write_reg(INA226_ADDR_NODE2, INA226_REG_CONFIG, ina_config);
        HAL_Delay(10);

        /* Initial read to populate values */
        ina226_read_all();
    }

    uartSend("BOOT,STM32G474_WELD_BRAIN_10KHZ_READY");
    /* Firmware build tag -- bump on each flashed change so the operator can
     * confirm (over UART / serial monitor) that the NEW firmware is actually
     * running. If this line is missing after a flash, the flash did not take
     * (e.g. a BlackMagic ".data MIS-MATCHED" verify failure) -- re-flash with a
     * full chip erase. */
    uartSend("BOOT,FW=cal-dblpulse-fix-2");

    {
        char boot_mode_msg[32];
        snprintf(boot_mode_msg, sizeof(boot_mode_msg), "BOOT,MODE=%d",
                 (int)trigger_mode);
        uartSend(boot_mode_msg);
    }

    HAL_UART_Receive_IT(&huart1, &rx_byte, 1);

    MX_IWDG_Init();

    while (1) {
        HAL_IWDG_Refresh(&hiwdg);

        pollPedal();
        pollContactTrigger();
        applyArmTimeout();
        applyReadyTimeout();

#if ADC_PAIR_VERBOSE_DEBUG
        {
            static int last_contact_dbg = -1;
            int c = contactDetected() ? 1 : 0;
            if (c != last_contact_dbg) {
                last_contact_dbg = c;
                char cbuf[96];
                snprintf(cbuf, sizeof(cbuf), "DBG,CONTACT=%d,vcap=%.2f,th=%.2f",
                         c, g_contact_last_vcap, g_contact_threshold_v);
                uartSend(cbuf);
            }
        }
#endif

        {
            static uint32_t last_temp_ms = 0;
            uint32_t now = HAL_GetTick();
            if ((now - last_temp_ms) >= 1000) {
                last_temp_ms = now;

                /* Refresh VDDA calibration every 1s alongside temperature */
                measured_vdda = measureVDDA();

                float t = readThermistor();
                if (t > -50.0f && t < 200.0f) {
                    temp_filtered_c = (0.1f * t) + (0.9f * temp_filtered_c);
                }
            }
        }

        /* NEW: INA226 read + charger state machine @ ~100ms interval */
        {
            static uint32_t last_ina_ms = 0;
            uint32_t now = HAL_GetTick();
            if ((now - last_ina_ms) >= 150) { /* 150ms matches AVG=64 conversion time */
                last_ina_ms = now;
                ina226_read_all();
                chargerStateMachine();
            }
        }

        /* Send STATUS + STATUS2 packets every 500ms */
        {
            static uint32_t last_chgstat_ms = 0;
            uint32_t now = HAL_GetTick();
            if ((now - last_chgstat_ms) >= 500) {
                last_chgstat_ms = now;
                sendStatusPacket();
            }
        }

        if (rx_line_ready) {
            char local_line[RX_LINE_MAX];
            __disable_irq();
            memcpy(local_line, rx_ready, sizeof(local_line));
            rx_line_ready = false;
            __enable_irq();
            parseCommand(local_line);
        }

#if DEBUG_UART_RX
        {
            static uint32_t last_health = 0;
            uint32_t now = HAL_GetTick();
            if (now - last_health >= 5000) {
                last_health = now;
                char hb[128];
                snprintf(hb, sizeof(hb),
                         "RXHEALTH,bytes=%lu,errors=%lu,overruns=%lu",
                         (unsigned long)uart_rx_bytes,
                         (unsigned long)uart_rx_errors,
                         (unsigned long)uart_rx_overruns);
                uartSend(hb);

                if (huart1.RxState == HAL_UART_STATE_READY) {
                    HAL_UART_Receive_IT(&huart1, &rx_byte, 1);
                    uartSend("RXHEALTH,REARM");
                }
            }
        }
#endif
    }
}

