farmertan81/Spot-Welder/STM32G474CE/src/main.c
void SysTick_Handler(void) {
    HAL_IncTick();
    HAL_SYSTICK_IRQHandler();
}

void USART1_IRQHandler(void) { HAL_UART_IRQHandler(&huart1); }

/**
 * @brief Timer Period Elapsed Callback
 *
 * Keep TIM1 PWM running continuously; do not stop/restart the timer from IRQ.
 * Output gating is handled by pwmOff() / pwmOnDuty() via CCR updates.
 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef* htim) {
    if (htim->Instance == TIM1) {
        /* Intentionally no HAL_TIM_PWM_Stop_IT() here (prevents PWM jitter).
         */
    }
}

/**
 * @brief TIM1 Update Interrupt Handler
 */
void TIM1_UP_TIM16_IRQHandler(void) { HAL_TIM_IRQHandler(&htim1); }

/* ═══════════════════════════════════════════════════════════════════════════
 * TIM2 Global Interrupt Handler
 * ═══════════════════════════════════════════════════════════════════════════
 * HIGHEST PRIORITY ISR — kills MOSFET gate drive within ~70 ns of TIM2
 * update event (counter overflow).  Direct register access only, no HAL.
 *
 * This is the core of the "brick shithouse" timing fix:
 *   1. TIM2 counts at 1 MHz (PSC=169, 170 MHz clock)
 *   2. ARR is loaded with (pulse_duration_us − 1)
 *   3. On overflow → this ISR fires → pwmOff() sets TIM1 CCR=0 → FET off
 *
 * DIER.UIE is armed ONLY during active weld pulses (preheat / main) and
 * disarmed before gap delays, so this ISR never fires during gap timing.
 */
void TIM2_IRQHandler(void) {
    if (TIM2->SR & TIM_SR_UIF) {
        pwmOff();               /* IMMEDIATE FET kill — CCR=0       */
        tim2_fet_killed = true; /* signal sampling loop to exit     */
        TIM2->SR = ~TIM_SR_UIF; /* clear UIF (write-0-to-clear)     */
    }
}